# Задание 1 – Предобработка данных. Создайте новый вектор my_vector, следующей
# строчкой:
# my_vector <- c(21, 18, 21, 19, 25, 20, 17, 17, 18, 22, 17, 18, 18, 19, 19, 27, 21, 20,
# 24, 17, 15, 24, 24, 29, 19, 14, 21, 17, 19, 18, 18, 20, 21, 21, 19, 17, 21, 13, 17, 13,
# 23, 15, 23, 24, 16, 17, 25, 24, 22)
# В векторе my_vector отберите только те наблюдения, которые отклоняются от среднего
# меньше, чем на одно стандартное отклонение. Сохраните эти наблюдения в новую
# переменную my_vector2. При этом исходный вектор оставьте без изменений.

my_vector <- c(21, 18, 21, 19, 25, 20, 17, 17, 18, 22, 17, 18, 18, 19, 19, 27, 21, 20,
24, 17, 15, 24, 24, 29, 19, 14, 21, 17, 19, 18, 18, 20, 21, 21, 19, 17, 21, 13, 17, 13,
23, 15, 23, 24, 16, 17, 25, 24, 22)
medium_value <- mean(my_vector)
my_vector2 <- c()
for(i in my_vector){
    if(abs(i - medium_value) <= 1){
        my_vector2 <- c(my_vector2, i)
    }
}
for(i in my_vector2){
    print(i)
}